Tekla Open API Reference for Tekla Structures 2025
ICurve Methods
The ICurve type exposes the following members.
Methods
Name | Description
Clone
 Returns a deep copy of the geometry
Top
See Also
Reference
ICurve Interface
Tekla.Structures.Geometry3d Namespace